Revit 2027 API
BuiltInFailures.FabricFailures.FabricAreaWrongSheetAlignment Property
 Fabric Area Sheet Alignment is incorrect. Can't create Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricAreaWrongSheetAlignment { get; }
Public Shared ReadOnly Property FabricAreaWrongSheetAlignment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricAreaWrongSheetAlignment {
	FailureDefinitionId^ get ();
}
static member FabricAreaWrongSheetAlignment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace